---
title: GroupLoadOptions
classe: Autodesk.Revit.DB.GroupLoadOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# GroupLoadOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IncludeAttachedDetails { get; set; }` | `groupLoadOptions.IncludeAttachedDetails` | Boolean |
| `Boolean IncludeGrids { get; set; }` | `groupLoadOptions.IncludeGrids` | Boolean |
| `Boolean IncludeLevels { get; set; }` | `groupLoadOptions.IncludeLevels` | Boolean |
| `Boolean IsValidObject { get; }` | `groupLoadOptions.IsValidObject` | Boolean |
| `Boolean ReplaceDuplicatedGroups { get; set; }` | `groupLoadOptions.ReplaceDuplicatedGroups` | Boolean |
| `Void Dispose()` | `groupLoadOptions.Dispose()` | Void |
| `IDuplicateTypeNamesHandler GetDuplicateTypeNamesHandler()` | `groupLoadOptions.GetDuplicateTypeNamesHandler()` | IDuplicateTypeNamesHandler |
| `Void SetDuplicateTypeNamesHandler(IDuplicateTypeNamesHandler)` | `groupLoadOptions.SetDuplicateTypeNamesHandler(handler)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```